IDEA Open Model
ResultOfInternalForces2 Class
Compatible with IDEA StatiCa 20.1
Note: This API is now obsolete.
 Result of internal forces in the one position
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfLoading2
 IdeaRS.OpenModel.Result.ResultOfInternalForces2
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
[ObsoleteAttribute]
public class ResultOfInternalForces2 : ResultOfLoading2
<ObsoleteAttribute>
Public Class ResultOfInternalForces2
	Inherits ResultOfLoading2
The ResultOfInternalForces2 type exposes the following members.
Constructors
Name | Description
ResultOfInternalForces2
 Constructor
Top
Properties
Name | Description
Loading
 LoadingTypeClass
Mx
 Bending moment around x-axis
My
 Bending moment around y-axis
Mz
 Bending moment around z-axis
N
 Normal force
Qy
 Shear force in y dirrection
Qz
 Shear force in z dirrection
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace